balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F86K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ANCON1" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL8" edc:desc="" edc:mask="0x1" edc:name="ANSEL8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL9" edc:desc="" edc:mask="0x1" edc:name="ANSEL9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL10" edc:desc="" edc:mask="0x1" edc:name="ANSEL10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL11" edc:desc="" edc:mask="0x1" edc:name="ANSEL11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL12" edc:desc="" edc:mask="0x1" edc:name="ANSEL12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL13" edc:desc="" edc:mask="0x1" edc:name="ANSEL13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL14" edc:desc="" edc:mask="0x1" edc:name="ANSEL14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL15" edc:desc="" edc:mask="0x1" edc:name="ANSEL15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANCON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ANCON0" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSEL0" edc:desc="" edc:mask="0x1" edc:name="ANSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL1" edc:desc="" edc:mask="0x1" edc:name="ANSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL2" edc:desc="" edc:mask="0x1" edc:name="ANSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL3" edc:desc="" edc:mask="0x1" edc:name="ANSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL4" edc:desc="" edc:mask="0x1" edc:name="ANSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL5" edc:desc="" edc:mask="0x1" edc:name="ANSEL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL6" edc:desc="" edc:mask="0x1" edc:name="ANSEL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSEL7" edc:desc="" edc:mask="0x1" edc:name="ANSEL7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nn--nn" edc:cname="MEMCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="x-xx--xx" edc:name="MEMCON" edc:nzwidth="8" edc:por="0-00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WM" edc:desc="" edc:mask="0x3" edc:name="WM" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="WAIT" edc:desc="" edc:mask="0x3" edc:name="WAIT" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EBDIS" edc:desc="" edc:mask="0x1" edc:name="EBDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WM0" edc:desc="" edc:mask="0x1" edc:name="WM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WM1" edc:desc="" edc:mask="0x1" edc:name="WM1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="WAIT0" edc:desc="" edc:mask="0x1" edc:name="WAIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WAIT1" edc:desc="" edc:mask="0x1" edc:name="WAIT1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="ODCON3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx---xxx" edc:name="ODCON3" edc:nzwidth="8" edc:por="00---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTMUDS" edc:desc="" edc:mask="0x1" edc:name="CTMUDS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="U1OD" edc:desc="" edc:mask="0x1" edc:name="U1OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2OD" edc:desc="" edc:mask="0x1" edc:name="U2OD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ODCON2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3OD" edc:desc="" edc:mask="0x1" edc:name="CCP3OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4OD" edc:desc="" edc:mask="0x1" edc:name="CCP4OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5OD" edc:desc="" edc:mask="0x1" edc:name="CCP5OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6OD" edc:desc="" edc:mask="0x1" edc:name="CCP6OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7OD" edc:desc="" edc:mask="0x1" edc:name="CCP7OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8OD" edc:desc="" edc:mask="0x1" edc:name="CCP8OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9OD" edc:desc="" edc:mask="0x1" edc:name="CCP9OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10OD" edc:desc="" edc:mask="0x1" edc:name="CCP10OD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="ODCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx----x" edc:name="ODCON1" edc:nzwidth="8" edc:por="000----0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2OD" edc:desc="" edc:mask="0x1" edc:name="SPI2OD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP1OD" edc:desc="" edc:mask="0x1" edc:name="CCP1OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2OD" edc:desc="" edc:mask="0x1" edc:name="CCP2OD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1OD" edc:desc="" edc:mask="0x1" edc:name="SPI1OD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
